In [1]:
import pandas as pd
df=pd.read_csv("startup_funding.csv")
df.head()

,SNo,Date,StartupName,IndustryVertical,SubVertical,CityLocation,InvestorsName,InvestmentType,AmountInUSD,Remarks
0,0,01/08/2017,TouchKin,Technology,Predictive Care Platform,Bangalore,Kae Capital,Private Equity,"1,300,000",NaN
1,1,02/08/2017,Ethinos,Technology,Digital Marketing Agency,Mumbai,Triton Investment Advisors,Private Equity,NaN,NaN
2,2,02/08/2017,Leverage Edu,Consumer Internet,Online platform for Higher Education Services,New Delhi,"Kashyap Deorah, Anand Sankeshwar, Deepak Jain,...",Seed Funding,NaN,NaN
3,3,02/08/2017,Zepo,Consumer Internet,DIY Ecommerce platform,Mumbai,"Kunal Shah, LetsVenture, Anupam Mittal, Hetal ...",Seed Funding,"500,000",NaN
4,4,02/08/2017,Click2Clinic,Consumer Internet,healthcare service aggregator,Hyderabad,"Narottam Thudi, Shireesh Palle",Seed Funding,"850,000",NaN

In [2]:
amount=df["AmountInUSD"]
amount.head()

0    1,300,000
1          NaN
2          NaN
3      500,000
4      850,000
Name: AmountInUSD, dtype: object

In [3]:
amount.dropna(inplace=True)
amount.head()

0    1,300,000
3      500,000
4      850,000
5    1,000,000
6    2,600,000
Name: AmountInUSD, dtype: object

In [4]:
a1=amount.str.replace(",","")
a1.head()

0    1300000
3     500000
4     850000
5    1000000
6    2600000
Name: AmountInUSD, dtype: object

In [5]:
a1[0]
#str

'1300000'

In [6]:
a2=pd.to_numeric(a1) #str to int
a2[0]

1300000

In [7]:
type(a2[0])

numpy.int64

In [8]:
pop_avg=a2.mean()
pop_min=a2.min()
pop_max=a2.max()
print(pop_avg)
print(pop_min)
print(pop_max)

12031073.099016393
16000
1400000000

## <b> Simple Random sampling </b>

In [9]:
population=a2
sample_size=100
population.sample() #randomly selects one record every time

298    191000
Name: AmountInUSD, dtype: int64

In [10]:
population.sample(sample_size)  #randomly selects 100 records every time

959      6000000
2147    25000000
1320      400000
1250       81000
1463     3000000
          ...
1493     1200000
1828      500000
897      1000000
679       500000
1096      250000
Name: AmountInUSD, Length: 100, dtype: int64

In [11]:
sample=population.sample(sample_size,random_state=1) #every time on executing we'll get same ans
#WITHOUT REPLACEMENT (random_sample=1)

In [12]:
sample.shape

(100,)

In [13]:
sample_Avg=sample.mean()
print(sample.mean())
print(sample.min())
print(sample.max())

24592930.0
18000
1400000000

In [14]:
print(pop_avg, " " ,sample.mean())
print(pop_min,"        ",sample.min())
print(pop_max," ",sample.max())

12031073.099016393   24592930.0
16000          18000
1400000000   1400000000

##### sampling error = parameter - statistic

In [15]:
df.head()

,SNo,Date,StartupName,IndustryVertical,SubVertical,CityLocation,InvestorsName,InvestmentType,AmountInUSD,Remarks
0,0,01/08/2017,TouchKin,Technology,Predictive Care Platform,Bangalore,Kae Capital,Private Equity,"1,300,000",NaN
1,1,02/08/2017,Ethinos,Technology,Digital Marketing Agency,Mumbai,Triton Investment Advisors,Private Equity,NaN,NaN
2,2,02/08/2017,Leverage Edu,Consumer Internet,Online platform for Higher Education Services,New Delhi,"Kashyap Deorah, Anand Sankeshwar, Deepak Jain,...",Seed Funding,NaN,NaN
3,3,02/08/2017,Zepo,Consumer Internet,DIY Ecommerce platform,Mumbai,"Kunal Shah, LetsVenture, Anupam Mittal, Hetal ...",Seed Funding,"500,000",NaN
4,4,02/08/2017,Click2Clinic,Consumer Internet,healthcare service aggregator,Hyderabad,"Narottam Thudi, Shireesh Palle",Seed Funding,"850,000",NaN

In [16]:
df=df[(df.CityLocation = 'Bangalore') or (df.CityLocation = 'Mumbai')]

SyntaxError: invalid syntax (<ipython-input-16-aa3d95258d7a>, line 1)

In [18]:
df=df[(df.CityLocation == 'Bangalore') | (df.CityLocation == 'Mumbai')]

## Stratified sampling

A truck manufacturer selects 300 trucks at random from each of 600 models for safety testing. Which sampling is this ?